In [1]:
#Q1
Explanation
 each time 2 will be added
so for b() a will be 0+2=2
    then
    b() a will be 2+2=4
    then 
    b() a will be 4+2=6
    
    hence a will be 6.
   
OUTPUT
a is 6

IndentationError: unexpected indent (3571666503.py, line 3)

In [2]:
#Q2
def fileLength(filename):
    
    try:
        f=open(filename,'r')
        
        data=f.readlines()
        
        line=""
        for i in data:
            line+=i
        result=len(line)
        return result
    except FileNotFoundError:
        return ("File {} not found.".format(filename))

print(fileLength('FileLength.txt'))
print(fileLength('FileLength.py'))

123
File FileLength.py not found.

In [15]:
class Marsupial:

    def __init__(self):
        self.pouch=[]

    def put_in_pouch(self, item):

        self.pouch.append(item)
    def pouch_contents(self):
        return self.pouch

class Kangaroo(Marsupial):
    
    def __init__(self, x,y):
        
        Marsupial.__init__(self)
        self.x=x
        self.y=y
   
    def jump(self, dx, dy):
        
        self.x+=dx
        self.x+=dy

    def __str__(self):
        return "I am a Kanagroo located at coordinates ("+str(self.x)+","+str(self.y)+")"

k = Kangaroo(0,0)

print(k)

k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())

k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kanagroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kanagroo located at coordinates (3,0)

In [17]:
#q4
def main():
    collatz(10)

def collatz(x):
    if x == 1:
        print(x)
    elif x % 2 == 0:
        print(x)
        x = x//2
        collatz(x)
    else:
        print(x)
        x = 3*x + 1
        collatz(x)

if __name__ == "__main__":
    main()

10
5
16
8
4
2
1

In [18]:
#Q5
def decimalToBinary(number):
   
    if number == 0 or number == 1:
        return str(number)
    
    return decimalToBinary(number // 2) + str(number % 2)



while True:

    
    n = input('Enter a positive integer or 0 to end : ')

   
    if n.isnumeric() and int(n) > 0:
       
        n = int(n)
        
        binary = decimalToBinary(n)
       
        print("The equivalent of {} in Binary is {}".format(n, binary))
    elif n == "0":
        break
    else:
        print('Error: An integer value was expected. Try again')
    print()

Enter a positive integer or 0 to end : 11
The equivalent of 11 in Binary is 1011

Enter a positive integer or 0 to end : 0

In [20]:
#Q6
from html.parser import HTMLParser


class HeadingParser(HTMLParser):
  
    headers = ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']


    def handle_starttag(self, tag, attrs):
        if tag in self.headers:
            print("headings "+tag)

    def handle_endtag(self, tag):
        if tag in self.headers:
            print(tag)

    def handle_data(self, data):
        print(data)


parser = HeadingParser()
infile = open('w3c.html')
content = infile.read()
infile.close()
hp = HeadingParser()
hp.feed(content)

Change_me












h1
W3C Mission
h1


h2
Principles
h2

In [21]:
#Q7
import requests
from bs4 import BeautifulSoup


def webdir(url, depth, indent):
    resp = requests.get(url)
    print(url)
    if(depth == indent):
        return
    soup = BeautifulSoup(resp.text, 'html.parser')
    for link in soup.findAll('a'):
        new_link = link.get('href')
        if(new_link.startswith('http')):
            webdir(new_link, depth, indent+1)


webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html', 2, 0)

http://reed.cs.depaul.edu/lperkovic/csc242/test1.html

In [23]:
%load_ext sql

In [24]:
#q8 
%sql sqlite://

In [27]:
%%sql

create table weather1(city varchar(15),country varchar(15),season varchar(15),temperature float,rainfall float);

 * sqlite://
Done.

[]

In [28]:
%%sql
INSERT INTO weather1 VALUES('Mumbai', 'India', 'Winter', 24.8,5.9),
('Mumbai', 'India', 'Spring', 28.4,16.2),
('Mumbai', 'India', 'Summer', 27.9,1549.4),
('Mumbai', 'India', 'Fall', 27.6,346.0),
('London', 'United kingdom', 'Winter', 4.2,207.7)
,('London', 'United kingdom', 'Spring', 8.3,169.6),
('London', 'United kingdom','Summer', 15.7,157.0),
('London', 'United kingdom','Fall', 10.4,218.5)
,('Cairo', 'Egypt','Winter', 13.6,16.5),
('Cairo', 'Egypt','spring', 20.7,6.5),
('Cairo', 'Egypt','Winter', 27.7,0.1),
('Cairo', 'Egypt', 'Spring', 22.2,4.5);

 * sqlite://
12 rows affected.

[]

In [30]:
%%sql
select temperature from weather1;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [31]:
%%sql
select distinct city from weather1;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [32]:
%%sql
select * from weather1 where country == 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

In [37]:
%%sql
select * from weather1 where season == 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United kingdom', 'Fall', 10.4, 218.5)]

In [38]:
%%sql
select city, country, season from weather1 where rainfall between 200 and 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United kingdom', 'Winter'),
 ('London', 'United kingdom', 'Fall')]

In [44]:
%%sql
select city, country from weather1 where season =='Fall' and temperature >20 order by temperature ASC;

 * sqlite://
Done.

[('Mumbai', 'India')]

In [45]:
%%sql
select sum(rainfall) AS annual_rainfall from weather1 where city =='Cairo';

 * sqlite://
Done.

[(27.6,)]

In [46]:
%%sql
select season, sum(rainfall) AS annual_rainfall from weather1 group by season;

 * sqlite://
Done.

[('Fall', 564.5),
 ('Spring', 190.29999999999998),
 ('Summer', 1706.4),
 ('Winter', 230.2),
 ('spring', 6.5)]

In [47]:
#q9
#Q9
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

#uppercase
print([x.upper() for x in words])

#lowercase
print([x.lower() for x in words])

#length of each word
print([len(x) for x in words])

#word upper,lower,no of owrds
print([[x.upper(), x.lower(), len(x)] for x in words])

#words 4+ charcs
print([x for x in words if len(x)>=4])

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
[3, 5, 5, 3, 5, 4, 3, 4, 3]
[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
['quick', 'brown', 'jumps', 'over', 'lazy']